import stremlit as st

#ส่วนที่่ 1 หัวข้อหน้าเว็บ (Title สีเเดง)
st.markdown("# :red[🏋️ คำนวณค่าดัชนีนวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักเเละส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องรับค่าน้ำหนัก เเละ ส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม) :", min_value=1.0, value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร) :", min_value=1.0, value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่า BMI 🎯"):
    # เเปลงส่วนสูงจาก CM เป็น เมตร เเล้วคำนวณ BMI
    height_m = height_cm / 100
    bmi = weight / (hright_m ** 2)

    st.write("---")
    st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่4 เเปลผลค่า BMI ตามเกณฑ์
  if bmi < 18.5:
      st.warning("⚠️ คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
  elif 18.5 <= bmi < 23.0:
      st.success("🎉 คุณมีน้ำหนักอยุ่ในเกณฑ์ (สุขภาพดี)")
  elif 23.0 <= bmi < 25.0:
      st.info("💡 คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
  elif:
      st.error("🚨 คุณอยุ่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพเเละออกกำลังกาย")

 st.divider()
 st.write("นายณัฐกัณย์ ธัญเสรีวงศ์ เลขที่ 12 ม.4/12")
